# PyTorch FCN ResNet50 Model
#
# При сегментировании объектов на изображениях каждый из этих классов будет иметь различную цветовую маску.

# информация по картинке при передаче его в качестве входных данных для модели нейронной сети сегментации изображений
# outputs = model(image)
# print(type(outputs))
# пакет содержит вывод для одного изображения, 21 - модель дает результат для 21класса, на котором была обучена,
# последние два числа - высота и ширина
# print(outputs['out'].shape)
# многие тензоры имеют одинаковый выходной номер(все пиксели одного объекта классифицируются/маркируются одним номером)
# print(outputs)


# Создание списка цветовой карты
# label_color_map = [(0, 0, 0), (236, 1, 134), (134, 68, 49), (246, 55, 24),
#                    (181, 112, 198), (121, 210, 255), (223, 249, 249), (24, 199, 247),
#                    (228, 35, 68), (171, 184, 39), (83, 119, 192), (170, 24, 137),
#                    (158, 150, 87), (55, 221, 193), (242, 97, 114), (16, 192, 76),
#                    (103, 168, 16), (26, 111, 0), (27, 165, 102), (157, 59, 33),
#                    (92, 148, 229), (125, 47, 191), (242, 89, 241), (24, 99, 119),
#                    (126, 18, 39), (110, 168, 6), (132, 146, 173), (242, 91, 232),
#                    (78, 223, 160), (112, 177, 49), (230, 102, 119), (254, 185, 42),
#                    (34, 242, 1), (251, 187, 151), (163, 172, 6), (161, 49, 75),
#                    (51, 127, 216), (96, 29, 47), (43, 182, 158), (60, 1, 155),
#                    (119, 251, 219), (23, 218, 249), (133, 138, 17), (34, 93, 179),
#                    (87, 2, 73), (71, 101, 115), (127, 41, 104), (237, 89, 192),
#                    (121, 242, 244), (61, 134, 211), (46, 223, 249), (223, 55, 26),
#                    (164, 206, 37), (151, 186, 32), (149, 144, 69), (223, 253, 8),
#                    (231, 105, 240), (86, 146, 103), (97, 6, 231), (86, 85, 11),
#                    (206, 2, 185), (86, 6, 58), (143, 110, 69), (173, 150, 29),
#                    (189, 244, 161), (17, 34, 94), (64, 42, 108), (70, 235, 19),
#                    (235, 254, 237), (61, 248, 219), (95, 1, 211), (140, 166, 103),
#                    (181, 55, 130), (232, 145, 51), (147, 147, 105), (108, 168, 114),
#                    (149, 153, 5), (61, 38, 1), (50, 216, 176), (136, 245, 142),
#                    (71, 6, 7), (135, 154, 143), (30, 46, 196), (192, 51, 47),
#                    (131, 157, 146), (220, 58, 87), (183, 88, 76), (19, 101, 196),
#                    (19, 212, 108), (51, 55, 219), (163, 44, 27)
#                    ]
label_color_map = [
               (0, 0, 0),  # background
               (128, 0, 0),  # aeroplane
               (0, 128, 0),  # bicycle
               (128, 128, 0),  # bird
               (0, 0, 128),  # boat
               (128, 0, 128),  # bottle
               (0, 128, 128),  # bus
               (128, 128, 128),  # car
               (64, 0, 0),  # cat
               (192, 0, 0),  # chair
               (64, 128, 0),  # cow
               (192, 128, 0),  # dining table
               (64, 0, 128),  # dog
               (192, 0, 128),  # horse
               (64, 128, 128),  # motorbike
               (192, 128, 128),  # person
               (0, 64, 0),  # potted plant
               (128, 64, 0),  # sheep
               (0, 192, 0),  # sofa
               (128, 192, 0),  # train
               (0, 64, 128)  # tv/monitor
]
